{
    "Marque os testes de aceitação adequados para a seguinte história:\nCartão: \n\"Eu como cliente do banco Itaú quero escolher o tipo de cartão de crédito farei os pagamentos das minhas contas\".\nCritérios de aceitação: \nO sistema deve aceitar apenas os cartões Visa e MarterCard;\nO limite mínimo para utilização do cartão é de R$ 100,00;\nO limite máximo para utilização do cartão é de R$ 10.000,00;": {
        "options": [
            "Teste com Visa e MasterCard (resposta: sucesso, é permitido).",
            "Teste com cartões diferentes de Visa e MasterCard (resposta: falha, não é permitido).",
            "Teste com utilização do cartão com valores inferiores a R$ 100,00 e superiores a R$ 10.000,00 (resposta: falha, não é permitido).",
            "Teste com números errados e/ou incompletos do cartão (resposta: falha, não é permitido).",
            "Teste com cartão fora da validade (resposta: falha, não é permitido).",
            "Teste com utilização do cartão com valores entre R$ 100,00 e R$ 10.000,00 (resposta: sucesso, é permitido)."
        ],
        "right_answers": [
            "Teste com Visa e MasterCard (resposta: sucesso, é permitido).,",
            "Teste com cartões diferentes de Visa e MasterCard (resposta: falha, não é permitido).,",
            "Teste com números errados e/ou incompletos do cartão (resposta: falha, não é permitido).,",
            "Teste com cartão fora da validade (resposta: falha, não é permitido).,",
            "Teste com utilização do cartão com valores entre R$ 100,00 e R$ 10.000,00 (resposta: sucesso, é permitido).,",
            "Teste com utilização do cartão com valores inferiores a R$ 100,00 e superiores a R$ 10.000,00 (resposta: falha, não é permitido)."
        ]
    },
    "Marque o tipo de arquitetura que é utilizada no exemplo, a seguir:\n\"Um aplicativo de streaming de vídeo que possui diversos serviços independentes para gerenciar funcionalidades como pesquisa de conteúdo, reprodução de vídeo, recomendações e faturamento. Cada serviço é desenvolvido, implantado e gerenciado de forma independente, facilitando a escalabilidade e a manutenção.\"": {
        "options": [
            "Microserviços",
            "Orientada a Serviços",
            "Cliente-Servidor",
            "Em camadas",
            "Monolítica"
        ],
        "right_answers": [
            "Microserviços"
        ]
    },
    "Sobre Design e Arquitetura. Marque as respostas corretas.": {
        "options": [
            "O design é outra maneira de ver a implementação, analisando e compreendendo como uma mudança em determinado ponto do sistema afeta o sistema inteiro, e de todas as maneiras possíveis.",
            "O projeto arquitetural é um processo extremamente determinístico e preditivo que não envolve criatividade.",
            "Do ponto de vista arquitetural, analisa-se como escolhas de implementação influenciam o sistema inteiro.",
            "Do ponto de vista do design há uma preocupação mais local (interface entre componentes etc)."
        ],
        "right_answers": [
            "Do ponto de vista arquitetural, analisa-se como escolhas de implementação influenciam o sistema inteiro.,",
            "Do ponto de vista do design há uma preocupação mais local (interface entre componentes etc)."
        ]
    },
    "Sobre histórias de usuário, marque as opções corretas.": {
        "options": [
            "Ao se identificar um conjunto de \"user roles\" que possuem os mesmos comportamentos e objetivos, deve-se mantê-los, visando tornar claro a quantidade total de tipos de usuário que irã ointeragir com a solução.",
            "Um \"user role\" é uma coleção definida de atributos que caracterizam uma população de usuários e suas intenções de interação com o sistema.",
            "A descrição de um \"user role\" deve ser realizada em um cartão, contendo: função do usuário e descrição.",
            "A identificação das histórias de usuário deve ser realizada sempre, anteriormente, a identificação dos tipos de usuários."
        ],
        "right_answers": [
            "Um \"user role\" é uma coleção definida de atributos que caracterizam uma população de usuários e suas intenções de interação com o sistema.,",
            "A descrição de um \"user role\" deve ser realizada em um cartão, contendo: função do usuário e descrição."
        ]
    },
    "Sobre os atributos de uma boa história de usuário, marque as opções corretas.": {
        "options": [
            "Pequena: histórias grandes dificultam as estimativas. Bem como histórias muito pequenas. Quebre ou agrupe dependendo do caso.",
            "Independente: as histórias devem ser independentes uma das outras.",
            "Testável: as histórias devem ser possíveis de serem testáveis.",
            "Testável: as histórias devem possuir testes unitários.",
            "Negociável: as histórias não são contratos, mas lembretes para discussões.",
            "Valorável: as histórias devem possuir valores estimáveis.",
            "Valorável: as histórias devem agregar valor para o cliente.",
            "Estimável: os desenvolvedores devem ser capazes de estimar o tamanhos das histórias."
        ],
        "right_answers": [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    },
    "Porque utilizar Histórias de Usuário?": {
        "options": [
            "Tiram o foco da escrita e vão para a fala.",
            "Apoiam e incentivam o desenvolvimento sequencial.",
            "Apoiam a elaboração participativa.",
            "Pode ser entendida e priorizada pelo cliente.",
            "São facilmente entendidas por desenvolvedores e clientes.",
            "São do tamanho certo para a definição do escopo total do projeto.",
            "Enfatizam os objetivos do desenvolvimento, e não os atributos de qualidade.",
            "São basicamente, grandes pedaços de funcionalidades."
        ],
        "right_answers": [
            "Tiram o foco da escrita e vão para a fala.,",
            "São facilmente entendidas por desenvolvedores e clientes.,",
            "Apoiam a elaboração participativa.,",
            "Pode ser entendida e priorizada pelo cliente."
        ]
    },
    "Marque o conjunto de critérios de aceitação que estão escritos adequadamente.": {
        "options": [
            "O sistema deve permitir o cadastro e edição de clientes.",
            "O sistema deve utilizar a arquitetura MVC.",
            "A consulta de clientes deve ser realizada por meio dos parâmetros: tipo de cliente (pessoa física ou pessoa jurídica) e status do cliente (ativo ou inativo).",
            "A lista de clientes deve ser exibida em ordem alfabética.",
            "O gráfico a ser exibido deve ser do tipo \"barras\"."
        ],
        "right_answers": [
            "A lista de clientes deve ser exibida em ordem alfabética.,",
            "A consulta de clientes deve ser realizada por meio dos parâmetros: tipo de cliente (pessoa física ou pessoa jurídica) e status do cliente (ativo ou inativo).,",
            "O gráfico a ser exibido deve ser do tipo \"barras\"."
        ]
    },
    "Marque as assertivas corretas, de acordo com Marsicano (2023), sobre a atividade de declaração de requisitos.": {
        "options": [
            "Envolve a apresentação dos requisitos em modelos e/ou visualizações do produto.",
            "A representação de requisitos possui como fonte de informações os requisitos declarados e presentes no backlog.",
            "Envolve a apresentação dos requisitos de maneira textual, em modelos e/ou visualizações do produto.",
            "A representação dos requisitos pode considerada formal (representações baseadas em uma sintaxe e semântica matemática), semiformal (representações que usam notações ou linguagem específicas) ou informal (linguagem natural)."
        ],
        "right_answers": [
            "Envolve a apresentação dos requisitos em modelos e/ou visualizações do produto.,",
            "A representação de requisitos possui como fonte de informações os requisitos declarados e presentes no backlog."
        ]
    },
    "Marque as opções que possuem os princípios do design de interface.": {
        "options": [
            "Aprendizagem, facilidade de uso e simplicidade.",
            "Aprendizagem, familiaridade do usuário, consistência e surpresa mínima.",
            "Recuperabilidade, facilidade de uso e aprendizagem.",
            "Recuperabilidade, orientação do usuário e diversidade de usuários.",
            "Facilidade de uso, simplicidade e intuitividade."
        ],
        "right_answers": [
            "Aprendizagem, familiaridade do usuário, consistência e surpresa mínima.,",
            "Recuperabilidade, orientação do usuário e diversidade de usuários."
        ]
    },
    "Sobre as conceituações vinculadas a Engenharia de Requisito (ER), marque as assertivas corretas.": {
        "options": [
            "A ER deve utilizar essencialmente, modelos matemáticos e técnicas de algoritmos para a execução de suas atividades.",
            "A ER deve utilizar das ciências sociais e cognitivas (filosofia, psicologia cognitiva, sociologia e linguística) para a execução de suas atividades.",
            "É uma área multidisciplinar, centrada no ser humano e em seus problemas, a qual deve ser realizada apenas no início de um ciclo de vida de desenvolvimento de produto ou solução de software.",
            "A ER deve fazer uso de um processo iterativo, incremental, técnico, específico e social.",
            "É uma área multidisciplinar, centrada no ser humano e em seus problemas.",
            "A ER deve fazer uso de um processo iterativo, incremental, cognitivo, social, comunicativo e criativo."
        ],
        "right_answers": [
            "É uma área multidisciplinar, centrada no ser humano e em seus problemas.,",
            "A ER deve utilizar das ciências sociais e cognitivas (filosofia, psicologia cognitiva, sociologia e linguística) para a execução de suas atividades.,",
            "A ER deve fazer uso de um processo iterativo, incremental, cognitivo, social, comunicativo e criativo."
        ]
    },
    "Para remover as dependências e duplicações entre histórias, como as do exemplo, abaixo, marque as opções adequadas.\nExemplo:\nComo um usuário eu posso pagar com o cartão Visa\nComo um usuário eu posso pagar com o cartão MasterCard\nComo um usuário eu posso pagar com o cartão American Express": {
        "options": [
            "Deve-se buscar deixar claro quais são os parâmetros a serem utilizados pela história.",
            "Deve-se buscar um caminho diferente para a divisão da história.",
            "Seria mais adequado ter a seguinte história: \"Como um usuário eu posso escolher o tipo de cartão de crédito, com o qual farei o pagamento.\"",
            "Deve-se combinas as dependências dentro de uma mesma história.",
            "Seria mais adequado ter a seguinte história: \"Como um usuário eu posso escolher cartão Visa, ou MasterCard ou American Express para realizar pagamento o pagamento das minhas contas.\""
        ],
        "right_answers": [
            "Deve-se combinas as dependências dentro de uma mesma história.,",
            "Deve-se buscar um caminho diferente para a divisão da história.,",
            "Seria mais adequado ter a seguinte história: \"Como um usuário eu posso escolher o tipo de cartão de crédito, com o qual farei o pagamento.\""
        ]
    },
    "Um projetista de software pode usar modelos de arquiteturas de aplicação de várias maneiras. São elas:": {
        "options": [
            "Como um meio de avaliar os componentes para reúso.",
            "Como ponto de partida para o processo de projeto de arquitetura.",
            "Como um meio de avaliar o padrão de interfaces com o usuário.",
            "Como uma maneira de organizar o trabalho do time de desenvolvimento."
        ],
        "right_answers": [
            "Como ponto de partida para o processo de projeto de arquitetura.,",
            "Como uma maneira de organizar o trabalho do time de desenvolvimento.,",
            "Como um meio de avaliar os componentes para reúso."
        ]
    },
    "Marque as assertivas corretas.": {
        "options": [
            "Uma arquitetura de microserviços deve ser utilizada em projetos que precisam de escalabilidade, flexibilidade e implantação independente de componentes.",
            "Dentre as desvantagens de uma arquitetura de microserviços, tem-se: complexidade na comunicação e no gerenciamento de serviços, e sobrecarga devido à comunicação entre serviços.",
            "Dentre as vantagens de uma arquitetura de microserviços, tem-se: modularidade, escalabilidade, implantação e manutenção independentes; e, resiliência."
        ],
        "right_answers": [
            "Uma arquitetura de microserviços deve ser utilizada em projetos que precisam de escalabilidade, flexibilidade e implantação independente de componentes.,",
            "Dentre as vantagens de uma arquitetura de microserviços, tem-se: modularidade, escalabilidade, implantação e manutenção independentes; e, resiliência.,",
            "Dentre as desvantagens de uma arquitetura de microserviços, tem-se: complexidade na comunicação e no gerenciamento de serviços, e sobrecarga devido à comunicação entre serviços."
        ]
    },
    "Sobre Histórias de Usuários, marque as opções corretas.": {
        "options": [
            "Todas as histórias de um produto devem ser identificadas no início do projeto.",
            "Uma história de usuário possui duas partes: cartão e critérios de aceitação.",
            "As histórias de usuário representam pequenos incrementos de uma funcionalidade, que podem ser desenvolvidas em uma período de dias a semanas.",
            "Histórias de usuários são especificações detalhadas dos requisitos de software.",
            "Detalhes do comportamento do sistema não aparecem no cartão."
        ],
        "right_answers": [
            "Detalhes do comportamento do sistema não aparecem no cartão.,",
            "As histórias de usuário representam pequenos incrementos de uma funcionalidade, que podem ser desenvolvidas em uma período de dias a semanas."
        ]
    },
    "Marque o tipo de arquitetura que é utilizada no exemplo, a seguir:\n\"Um blog simples onde todas as funcionalidades, como exibição de postagens, adição de comentários e gerenciamento de usuários, estão combinadas em um único aplicativo. Todas as solicitações são tratadas pelo mesmo processo, e o aplicativo é implementado como uma única unidade.\"": {
        "options": [
            "Monolítica",
            "Orientada a Serviços",
            "Cliente-Servidor",
            "Em camadas",
            "Microserviços"
        ],
        "right_answers": [
            "Monolítica"
        ]
    },
    "Marque os atributos de uma boa história.": {
        "options": [
            "Estimável, Pequena e Testável.",
            "Independente, Negociável e Valorável.",
            "Organizável, Negociável e Valorável.",
            "Independente, Observável e Valorável.",
            "Estimável, Pequena e Organizável."
        ],
        "right_answers": [
            "Independente, Negociável e Valorável.,",
            "Estimável, Pequena e Testável."
        ]
    },
    "Em virtude do relacionamento entre as características não funcionais do sistema e sua arquitetura, a escolha do estilo de arquitetura e da estrutura deve depender dos requisitos não funcionais do sistema. Dentre eles, tem-se:": {
        "options": [
            "Disponibilidade",
            "Valor de Negócio",
            "Desempenho",
            "Segurança da Informação",
            "Acurácia"
        ],
        "right_answers": [
            "Desempenho,",
            "Segurança da Informação,",
            "Disponibilidade"
        ]
    },
    "No exemplo: \"Como consumidor, eu quero ser capaz de ver o meu uso diário de energia para que eu possa começar a entender como reduzir meus custos ao longo do tempo.\" Marque os critérios de aceitação adequados.": {
        "options": [
            "O sistema deve ler dados em decawatts a cada 10 segundos. Exibi-los no portal, em incrementos de 15 minutos e, exibir no display de casa, a cada leitura.",
            "O sistema deve ler quilowatt de novos dados como disponível e exibir no portal a cada hora e no display de casa depois de cada leitura.",
            "Quaisquer \"user roles\" poderão acessar a história.",
            "O sistema não deve apresentar uma tendência de consumo diário."
        ],
        "right_answers": [
            "O sistema deve ler dados em decawatts a cada 10 segundos. Exibi-los no portal, em incrementos de 15 minutos e, exibir no display de casa, a cada leitura.,",
            "O sistema deve ler quilowatt de novos dados como disponível e exibir no portal a cada hora e no display de casa depois de cada leitura.,",
            "O sistema não deve apresentar uma tendência de consumo diário."
        ]
    },
    "Sobre verificação e validação de requisitos, marque as assertivas corretas.": {
        "options": [
            "Nas abordagens dirigidas a plano a verificação e validação de requisitos são realizadas, integralmente, no início do ciclo de vida do produto.",
            "No processo unificado, a validação dos requisitos é realizada a cada iteração.",
            "No scrum, a validação dos requisitos realizada pelos clientes é realizada nas reuniões de revisão.",
            "No scrum, a verificação dos requisitos realizada pela equipe scrum pode ser realizada ao longo de todo o desenvolvimento do produto.",
            "No XP, a validação de requisitos é realizada após a entrega dos incrementos de software.",
            "No RAD, a verificação de requisitos é realizadas ao final do desenvolvimento do produto."
        ],
        "right_answers": [
            "No scrum, a validação dos requisitos realizada pelos clientes é realizada nas reuniões de revisão.,",
            "No scrum, a verificação dos requisitos realizada pela equipe scrum pode ser realizada ao longo de todo o desenvolvimento do produto.,",
            "No processo unificado, a validação dos requisitos é realizada a cada iteração."
        ]
    },
    "Marques as opções que apresentam estilos arquiteturais.": {
        "options": [
            "Model-View-Controller e Presentation-Abstraction-Control, para sistemas interativos.",
            "Model-View-Controller e Presentation-Abstraction-Control, para sistemas distribuídos.",
            "Microkernel e reflexão, para estruturas gerais.",
            "Cliente-servidor e três camadas, para sistemas distribuídos.",
            "Microkernel e reflexão, para sistemas adaptáveis."
        ],
        "right_answers": [
            "Cliente-servidor e três camadas, para sistemas distribuídos.,",
            "Model-View-Controller e Presentation-Abstraction-Control, para sistemas interativos.,",
            "Microkernel e reflexão, para sistemas adaptáveis."
        ]
    },
    "Sobre a execução da Engenharia de Requisitos (ER) em abordagens dirigidas a plano e ágeis, marque as assertivas corretas.": {
        "options": [
            "Nas abordagens ágeis o esforço de ER tende a ser nivelado durante todo o projeto.",
            "As abordagens ágeis e dirigidas a plano realizam o mesmo conjunto de atividades de ER.",
            "As abordagens ágeis e dirigidas a plano realizam um conjunto diferente de atividades de ER.",
            "As abordagens ágeis realizam um conjunto maior de atividades de ER.",
            "Nas abordagens dirigidas a plano, tende-se a realizar um maior esforço de ER no início dos projetos.",
            "As abordagens ágeis realizam um conjunto menor de atividades de ER."
        ],
        "right_answers": [
            "As abordagens ágeis e dirigidas a plano realizam o mesmo conjunto de atividades de ER.,",
            "Nas abordagens dirigidas a plano, tende-se a realizar um maior esforço de ER no início dos projetos.,",
            "Nas abordagens ágeis o esforço de ER tende a ser nivelado durante todo o projeto."
        ]
    },
    "Sobre as vantagens do uso de arquitetura de software, marque as respostas corretas.": {
        "options": [
            "A arquitetura de sistema consegue apoiar o reúso de software em larga escala, pois refere-se a uma descrição compacta e gerenciável de como um sistema é organizado e de como os componentes operam entre si.",
            "O desenvolvimento da arquitetura serve para a análise de sistema, visando tornar explícita a arquitetura de sistema em um estágio inicial no desenvolvimento.",
            "A arquitetura serve para comunicação com os stakeholders, onde a arquitetura é uma apresentação de alto nível  do sistema que pode ser usada como foco de discussão por vários stakeholders."
        ],
        "right_answers": [
            "A arquitetura serve para comunicação com os stakeholders, onde a arquitetura é uma apresentação de alto nível  do sistema que pode ser usada como foco de discussão por vários stakeholders. ,",
            "O desenvolvimento da arquitetura serve para a análise de sistema, visando tornar explícita a arquitetura de sistema em um estágio inicial no desenvolvimento.,",
            "A arquitetura de sistema consegue apoiar o reúso de software em larga escala, pois refere-se a uma descrição compacta e gerenciável de como um sistema é organizado e de como os componentes operam entre si."
        ]
    },
    "De acordo com Marsicano (2023), marque as assertivas corretas sobre elicitação e descoberta de requisitos.": {
        "options": [
            "A elicitação e descoberta podem ser realizadas, por meio de várias fontes de informação como, por exemplo, stakeholders, documentos, ferramentas (IA), softwares e sistemas existentes.",
            "A elicitação e descoberta refere-se apenas a identificação de requisitos funcionais (RFs) e requisitos não funcionais (RNFs).",
            "A elicitação e descoberta também envolve descobrir quem são os interessados, seus problemas, necessidades, desejos e expectativas, além de outros fatores que podem representar possibilidades ou restrições ao produto de software.",
            "Para o desenvolvimento de um produto novo, a elicitação e descoberta deve ser a terceira ou quarta atividade da ER a ser realizada."
        ],
        "right_answers": [
            "A elicitação e descoberta podem ser realizadas, por meio de várias fontes de informação como, por exemplo, stakeholders, documentos, ferramentas (IA), softwares e sistemas existentes.,",
            "A elicitação e descoberta também envolve descobrir quem são os interessados, seus problemas, necessidades, desejos e expectativas, além de outros fatores que podem representar possibilidades ou restrições ao produto de software."
        ]
    },
    "De acordo com Marsicano (2023)as atividades da disciplina de Engenharia de Requisitos (ER), são:": {
        "options": [
            "Elicitação, análise e design de requisitos.",
            "Representação, verificação e validação, e organização e atualização.",
            "Elicitação e descoberta, análise e consenso de requisitos, e declaração.",
            "Verificação, detalhamento e organização de requisitos."
        ],
        "right_answers": [
            "Elicitação e descoberta, análise e consenso de requisitos, e declaração.,",
            "Representação, verificação e validação, e organização e atualização."
        ]
    },
    "Sobre o design de interface, marque as respostas corretas.": {
        "options": [
            "A  interface de um sistema interativo compreende toda a porção do sistema com a qual o usuário mantém contato físico (motor ou perceptivo) ou conceitual durante a interação.",
            "O design da interface do usuário deve resolver dois problemas principais: Como o usuário deve interagir com o software? Como as informações do software devem ser apresentadas ao usuário?",
            "As interações podem ser classificadas nos seguintes estilos principais: Resposta da questão, Manipulação direta, Seleção do menu, Preenchimento de formulário, Linguagem de comando e Linguagem natural.",
            "A utilização da técnica de Mockup serve para simular a implementação da solução e, portanto, deve ser aplicada no início do projeto de interface.",
            "As técnicas mais comumente utilizadas para o estabelecimento do design de interface são JAD e Spiral."
        ],
        "right_answers": [
            "",
            "",
            "A  interface de um sistema interativo compreende toda a porção do sistema com a qual o usuário mantém contato físico (motor ou perceptivo) ou conceitual durante a interação."
        ]
    },
    "Sobre padrões de projetos, marque as opções corretas.": {
        "options": [
            "Builder, factory, prototype, singleton, são padrões estruturais.",
            "Builder, factory, prototype, singleton, são padrões de comportamento.",
            "Adapter, bridge,  composite,  decorator,  façade,  flyweight, proxy, são padrões de criação.",
            "Padrões de projeto incluem, por exemplo: padrões de criação, padrões estruturais e padrões de comportamento.",
            "É uma comum solução para um problema comum em um determinado contexto."
        ],
        "right_answers": [
            "É uma comum solução para um problema comum em um determinado contexto.,",
            "Padrões de projeto incluem, por exemplo: padrões de criação, padrões estruturais e padrões de comportamento."
        ]
    },
    "Para o Swebok, existem duas atividades principais da Disciplina de Design de Software. Marque quais são:": {
        "options": [
            "Projeto Visual: responsável pela construção dos diagramas de classes, arquitetura, componentes, por exemplo.",
            "Projeto detalhado do software (também, denominado Projeto ou DESIGN, por alguns autores): especifica cada componente com detalhes suficientes para facilitar sua construção.",
            "Projeto Estrutural: responsável pela definição das estrutura de hardware e software do projeto.",
            "Projeto de arquitetura de software (às vezes chamado de projeto de alto nível ou ARQUITETURA): desenvolve a estrutura e a organização de nível superior do software e identifica os vários componentes.",
            "Projeto de Usabilidade (também, denominado Design de Interface, por alguns autores): especifica as interfaces que serão construídas."
        ],
        "right_answers": [
            "",
            ""
        ]
    }
}